
/**
 * homework_001
 * Реализовать, с учетом ооп подхода, приложение.
Для проведения исследований с генеалогическим древом.
Идея: описать некоторое количество компонент, например:
модель человека
компонента хранения связей и отношений между людьми: родитель, ребёнок - классика, 
но можно подумать и про отношение, брат, свекровь, сестра и т. д.
компонент для проведения исследований
дополнительные компоненты, например отвечающие за вывод данных в консоль, загрузку и сохранения в файл, получение\построение отдельных моделей человека
Под “проведением исследования” можно понимать получение всех детей выбранного человека.
 */
public class homework_001 {

    public static void main(String[] args) {
        Human ya = new Human("василий", "трунов", Gender.man, 
                            20, 1, 2000);
        Human mom = new Human("маргарина", "трунова", Gender.woman, 
                                28, 3, 1673);
        ya.indicateParents(mom);
        HumanInfo inf = new HumanInfo(mom);
        inf.printFullInfo();

    }
}